In [11]:
import pandas as pd

In [12]:
orig_df = pd.DataFrame({'Student_Id': {0: 1, 1: 2, 2: 3},
              'Student_Name': {0: 'abc', 1: 'def', 2: 'ghi'},
              'Course_1_marks': {0: 27, 1: 23, 2: 21},
              'Course_2_marks': {0: 27, 1: 23, 2: 21},
              'Course_3_marks': {0: 27, 1: 23, 2: 21}
             })

In [13]:
orig_df

   Student_Id Student_Name  Course_1_marks  Course_2_marks  Course_3_marks
0           1          abc              27              27              27
1           2          def              23              23              23
2           3          ghi              21              21              21

In [14]:
new_df = pd.melt(frame = orig_df.rename(columns={'Course_1_marks':'Course_1', 
                                                 'Course_2_marks':'Course_2', 
                                                 'Course_3_marks':'Course_3'}, 
                                        inplace=False), 
                 id_vars = ['Student_Id'], 
                 value_vars = ['Course_1', 'Course_2', 'Course_3'],
                 var_name = 'Course',
                 value_name = 'Marks')

In [15]:
new_df

   Student_Id    Course  Marks
0           1  Course_1     27
1           2  Course_1     23
2           3  Course_1     21
3           1  Course_2     27
4           2  Course_2     23
5           3  Course_2     21
6           1  Course_3     27
7           2  Course_3     23
8           3  Course_3     21